sdaiAccessModel(Sdai_instS*,SdaiAccessMode)
\details
Opens a specified model in a specified mode.
\param model  [in] A model to be open.
\param mode   [in] An access mode.
\returns A pointer to the open model if the function successfully opened the model; otherwise, the function returns the NULL value.